pandas的两个主要数据结果：Series和Dataframe
Series 是类似一维数组的对象，它由一组数据（numpy）以及一组与之相关的索引标签构成

In [26]:
from pandas import Series
import pandas as pd
from pandas import DataFrame as df
obj = Series([4,7,-5,3])#类似用np.array生成数组的方法
obj.values
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj2 = Series([4,7,-5,3], index=['a','b','c','d'])#指定索引的标签

In [16]:
obj2.index
obj2['a']#通过索引获取值
obj2[obj2>0]#通过布尔条件获取值

a    4
b    7
d    3
dtype: int64

可以直接通过字典来创建series

In [18]:
data = {'a':100,'b':200,'c':300}
obj_data = Series(data)
print(obj_data)

a    100
b    200
c    300
dtype: int64

检测缺失值

In [ ]:
pd.isnull(obj)
pd.notnull(obj)
obj.isnull()
obj.notnull()

在运算中可以自动对齐不同索引的数据

In [19]:
data1 = {'a':100,'b':200,'c':300}
obj_data1 = Series(data1)
obj_data + obj_data1

a    200
b    400
c    600
dtype: int64

In [ ]:
dataframe 既有行索引也有列索引，被由series组成的字典

In [ ]:
构建dataframe

In [59]:
data = {'name':['a','b','c','d'],
       'age':[34,23,24,26],
       'score':[79,98,69,80]}
df(data)#自动添加序号索引

  name  age  score
0    a   34     79
1    b   23     98
2    c   24     69
3    d   26     80

In [ ]:
按照指定列 排序展示

In [60]:
data1 = DataFrame(data,columns=['age','score','name'],index=['zero','one','two','three'])

In [47]:
data1.columns
data1['age']
data1['name']
data1.name

zero     a
one      b
two      c
three    d
Name: name, dtype: object

In [ ]:
增加新的列和值，长度必须匹配

In [61]:
data1['salary'] = [5000,4000,3000,6000]
data1

       age  score name  salary
zero    34     79    a    5000
one     23     98    b    4000
two     24     69    c    3000
three   26     80    d    6000

In [ ]:
删除列

In [62]:
del data1['score']

In [64]:
data1.salary.values

array([5000, 4000, 3000, 6000], dtype=int64)

In [ ]:
重新构建索引，并填充索引对应的值

In [65]:
data = Series([1,2,3],index=['a','b','c'])
data.reindex(['a','b','c','d'], fill_value=4)

a    1
b    2
c    3
d    4
dtype: int64

In [87]:
import numpy as np
frame = DataFrame(np.arange(9).reshape(3,3), index=['a','b','c'],columns=['ohio','texas','california'])
cols =['ohio','texas','california','utah']
frame1 = frame.reindex(['a','b','c','d'])
frame2 = frame.reindex(columns=cols)
frame2['utah']=[5,6,7]
frame2

   ohio  texas  california  utah
a     0      1           2     5
b     3      4           5     6
c     6      7           8     7

丢弃指定索引上的值

In [93]:
#frame2.drop('utah')
frame2.drop(['a','c'])
frame2.drop('utah',axis=1)

   ohio  texas  california
a     0      1           2
b     3      4           5
c     6      7           8